{"img":"article-2.png","summary":"Apple has lied to us.  Contrary to popular belief, there&rsquo;s not always &ldquo;an app for that.","keywords":"","title": "5 Apps That Should Be A Thing But Aren&rsquo;t","author": "Maggie Green","date": "February 22, 2014","text":"Apple has lied to us.  Contrary to popular belief, there&rsquo;s not always &ldquo;an app for that.&rdquo;  And no matter how many of your pathetic post-grad friends have a &ldquo;start up&rdquo; in which they&rsquo;re &ldquo;creating a new app,&rdquo; there is still a horrible, gaping empty hole in the app market.\r\n\t\t<br \/><br \/>\r\n\t\tMaybe I&rsquo;m in the particular place to notice this glaring omission in the app store because I spend roughly 40 hours a week drinking (being a second semester senior is a full-time job).  As I&rsquo;ve discovered through four years of extreme drinking, simply shouting at your iPhone to do things doesn&rsquo;t mean it will.  So since the app store doesn&rsquo;t have your back, here&rsquo;s a starter list of apps that should exist, but don&rsquo;t.\r\n\t\t<br \/><br \/>\r\n\t\tHackYale, the ball&rsquo;s in your court.\r\n\t\t<br \/><br \/>\r\n\t\t<b>1. Adopt a Sexiled Roommate<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tWe&rsquo;ve all been there.  It&rsquo;s been a long night.  You&rsquo;ve just made the long journey home- your ears stinging from the cold and the remnants of your 2am Wenzel decorating your cheek.   All you want is to tiptoe through the common room, slip into your room, and pass out on top of your sheets with all of your clothes still on.You stumble loudly through the common room, tripping on your suitemate&rsquo;s discarded clothing, only to reach your door and find, to your chagrin, the staple sock on the doorknob (or whatever code you have worked out.  I don&rsquo;t know your life).\r\n\t\t<br \/><br \/>\r\n\t\tThis heartbreaking and vaguely gut-wrenching news is always an unwelcome end to a long night of binge drinking in some sophomore&rsquo;s common room.  So, what can you do?   You attempt to curl up on the stained, lumpy futon you&rsquo;ve had for the last three years and cry yourself to sleep as you try to shut out the faint sound (or rather, not so faint.  Yale walls are far too thin) of your roommate&rsquo;s bed hitting the wall.  Gross. If only there were some service where the sexiled could find a safe space.  A welcoming bed or couch where they can feel warm and cozy for the night and sleep in gentle silence.  Or maybe find a companion of their own.  \r\n\t\t<br \/><br \/>\r\n\t\tAdopt-A-Sexiled Roommate allows generous hosts to select how many sexiled souls they can accommodate per night, where their guests can sleep, and until what time they may be contacted.  Think of it like a B&B for the drunk, disoriented, and depressed.  What could be better than that? The Sexiled individual merely has to browse the available hosts, select one, and send a message indicating interest in the accommodations.  Fast forward an hour or so, and everyone is safe and warm and not listening to someone else&rsquo;s strange and awkward hook up.\r\n\t\t<br \/><br \/>\r\n\t\t<b>2. &ldquo;Should I Go To This Frat Tonight?&rdquo; : A Randomized Answer System<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tFreshmen and Sophomores, this one is for you.  How I wish I had owned this app during my wild and rachet freshman days, or rather, I&rsquo;m told they were wild and rachet.  I don&rsquo;t really remember much about them.\r\n\t\t<br \/><br \/>\r\n\t\tIt&rsquo;s around midnight and&mdash;let&rsquo;s not sugar coat it&mdash;you&rsquo;re completely shitfaced.  You&rsquo;ve walked into countless suites filled with people you don&rsquo;t know, downed a few shots of Dubra, and made your exit as you threw your Solo cup on the ground.  But now the dilemma: where do you go from here?  A few of your friends chirp up:\r\n\t\t<br \/>\r\n\t\t&nbsp;&nbsp;&nbsp;&nbsp;&ldquo;SAE is having a late night!&rdquo;\r\n\t\t<br \/>\r\n\t\t&nbsp;&nbsp;&nbsp;&nbsp;&ldquo;ADPhi is mixing with someone but I&rsquo;m sure we can get in!&rdquo;\r\n\t\t<br \/>\r\n\t\t&nbsp;&nbsp;&nbsp;&nbsp;&ldquo;I got an invite to a Sig Chi party!&rdquo;\r\n\t\t<br \/>\r\n\t\tAll of these sound like good ideas to your alcohol-enhanced mind.  Just to be sure, however, you pull out your trusty smartphone, complete with newly cracked screen, and ask your &ldquo;Should I go to this Frat tonight?&rdquo; app to guide your way.\r\n\t\t<br \/><br \/>\r\n\t\tThe thing about this app, however, is that the &ldquo;randomized&rdquo; answer it provides you always seems to be some iteration of &ldquo;no.&rdquo;  As we all know, your phone always knows what&rsquo;s best for you.  So why shouldn&rsquo;t you listen to it now? Go run a naked lap around Old Campus instead...it&rsquo;ll make a much better story.\r\n\t\t<br \/><br \/>\r\n\t\t<b>3. &ldquo;Baby, It&rsquo;s Cold Outside&rdquo;: A Weather-Based Alarm<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tWe all know that August and September are going to be stupidly hot, and January is going to be so cold that our spit will freeze in our mouths.  But what the fuck do we expect in October? March? Don&rsquo;t even get me started on April.\r\n\t\t<br \/><br \/>\r\n\t\tOne of the most annoying feelings (and first world problems) is leaving your room inappropriately dressed for the weather.  Forgetting your jacket on a November evening is almost as bad as wearing your down coat on an April afternoon.\r\n\t\t<br \/><br \/>\r\n\t\tYou can check your iPhone weather app all you want&mdash; 50F is bikini weather in March and parka weather in October.  So, other than wearing everything in your closet every time you leave your room, it would be nice to have some indication of what you should be wearing before you run down four flights of stairs.\r\n\t\t<br \/>\r\n\t\tBaby, It&rsquo;s Cold Outside sets off an an alarm when you&rsquo;re about to leave your room over or under dressed for the weather.  Simply set your exit time, and it&rsquo;ll check the current weather at that moment and make sure you&rsquo;re aware what Mother Nature has in store for you.\r\n\t\t<br \/><br \/>\r\n\t\tHow it knows what you&rsquo;re currently wearing, I don&rsquo;t know.  But that&rsquo;s not really my job, is it?\r\n\t\t<br \/><br \/>\r\n\t\t<b>4. Snapchat Lock<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tWe all have our less than perfect nights.  Sometimes, we miss a few of the details: a text message we shouldn&rsquo;t have sent, a phone call we shouldn&rsquo;t have made.  Or the worst possible phone-related mishap: the snapchat we shouldn&rsquo;t have taken.\r\n\t\t<br \/><br \/>\r\n\t\tThere is nothing quite as terrifying as seeing that little sent arrow next to every name on your Snapchat contacts, and having no idea what image you have proliferated.  One of the most mortifying moments of my life was when a friend casually commented, &ldquo;Oh, you were blackout?  That explains the Snapchat.&rdquo;\r\n\t\t<br \/><br \/>\r\n\t\tHow do we prevent this pictorial faux pas?  A Snapchat lock.  Or rather, the Snapchat Lock.  The lock interacts with your Blood Alcohol Content (I&rsquo;m thinking some sort of Breathalyzer component to the app.  iPhones can do that, right?) to determine when you&rsquo;ve crossed the Snapchat-appropriate line.  The app simply locks out so that you can&rsquo;t take some potentially incriminating snaps.\r\n\t\t<br \/><br \/>\r\n\t\tFair warning: your camera will still work.  And those pictures don&rsquo;t disappear in 10 seconds.\r\n\t\t<br \/><br \/>\r\n\t\t<b>5. Library Occupancy Meter<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tThis app was a suggestion by my dear SWUGged-out suitemate.  You know those wonderful little meters on the dining app that tell you how busy a dining hall is at any given time? The ones that are probably complete bs?  Imagine that, but for your favorite Yale library space.\r\n\t\t<br \/><br \/>\r\n\t\tWho doesn&rsquo;t hate the prowl through the library spaces, making bitch faces at whomever will meet your gaze as you search for a single seat, preferably near an outlet?  And think about it, the more people in a library, the more likely it is you&rsquo;ll run into that awkward hook up from last semester that you hoped never to see again.\r\n\t\t<br \/><br \/>\r\n\t\tFind the most available study space with just the click of a button.  And then cry miserably, because it&rsquo;s Friday night and you&rsquo;re celebrating the fact that you secured a desk in the JE library."}