{"title":"5 Steps to Your Dream Beach Body","author":"Aryeh Coburn-Soloway","date":"March 7, 2014","text":"It&rsquo;s the beginning of March and we&rsquo;ve got t-minus two months until the summer. Maybe you&rsquo;ve put on a little insulation during the past few months and want to shed the extra layer, or maybe you just want to polish up those guns and buns. In any case, you&rsquo;ve probably got a tight schedule between problem sets, club meetings, and watching Netflix. Here are a few ways to make the most of your precious gym time and get some results:<br \/>\r\n<br \/>\r\n<img src='pic1.jpg'><br \/>\r\n <br \/>\r\n<b>1. Put It In Writing<\/b><br \/>\r\n<br \/>\r\nMake a schedule for yourself. It will let you visualize how your workouts and meals will fit into your day. Also, it will enable you to figure out backup plans for the inevitable days where you pulled an all-nighter and won&rsquo;t set foot in a gym for at least 8 hours.<br \/>\r\n<br \/>\r\nWhether it&rsquo;s in the form of a Word document in a calendar-style table, drawn on a dry-erase board hanging in your room, or taped onto your laptop, having a schedule is key. <br \/>\r\n<br \/>\r\n<b>2. Putting In the Twerk: High-Intensity Intervals<\/b><br \/>\r\n<br \/>\r\nWe all have that marathon-crazy friend who trains for an hour or two every single day, but seriously . . . ain&rsquo;t nobody got time for that. If you want to burn off calories without putting in all the time your solution is interval training. This can be done with various exercises (running, rowing, cycling, etc.) and involves alternating between periods of high-intensity\/anaerobic activity and low-intensity activity, and best of all, only takes 20 minutes. For instance, a sample interval routine could utilize a treadmill&rsquo;s variable speed settings as follows: 1 minute at 6.5mph alternating with 1 minute at 10mph.<br \/>\r\n<br \/>\r\nMore detailed explanation here: <a href='http:\/\/www.medicinenet.com\/interval_training\/article.htm'>http:\/\/www.medicinenet.com\/interval_training\/article.htm<\/a><br \/>\r\n<br \/>\r\n<b>Work your Core&mdash;With Weight!<\/b><br \/>\r\n<br \/>\r\nIt almost goes without saying, but if your want any part of your body to get more defined, you need to exercise it. Doing a number of various abdominal exercises will help target your midsection for both fat loss and definition. So you need to do weighted activity in order to stress your abs to the point of growth. Instead of doing sets of 50 sit-ups, try doing sets of 15 crunches with a 10lb or 25lb plate held overhead or to your chest. Hold a light dumbbell between your feet during leg-raises, and don&rsquo;t forget those Russian Twists for obliques!<br \/>\r\n<br \/>\r\nAll of your core efforts will be for naught unless you truly activate those muscles. Keeping this in mind, make sure that from the start position of EVERY SINGLE REPETITION you are pulling with your abdominals and not wasting your own time.<br \/>\r\n<br \/>\r\nMore exercises here:<br \/>\r\n <br \/>\r\n<img src='pic2.png'><br \/>\r\n<br \/>\r\n<b>Max-OT<\/b><br \/>\r\n<br \/>\r\nMax-OT, or Maximum Overload Training, is an intense weight-training program, which will minimize your time in the gym, but also blast your muscles! The workouts generally only last 30-45 minutes and rely on free weight lifts and compound exercises to focus on stabilizer muscles and maximum muscle growth. The idea is to do 4-6 repetitions per set, and do 6-9 total sets with 2-3 minutes of rest between each set. Each muscle group should only be worked once per week. Minimizing your gym time should enable you to put in more days at the gym since it should be easy to &ldquo;sneak in&rdquo; 45 minutes each day.<br \/>\r\n<br \/>\r\nMore sample routines here: <a href='http:\/\/www.jeffwillet.com\/newsite\/training-nutrition\/workout-routine\/'>http:\/\/www.jeffwillet.com\/newsite\/training-nutrition\/workout-routine\/<\/a><br \/>\r\n<br \/>\r\n<b>3. Nom Noms<\/b><br \/>\r\n<br \/>\r\nIf you spend twelve hours in the gym a day, but wind up consuming more calories than you burn, those twelve hours will not make you any more defined. Sure, you&rsquo;ll build muscle, but if your goal is to lose weight, you need to eat fewer calories than you burn. It&rsquo;s that simple. <br \/>\r\n<br \/>\r\nIf you are interested in making your muscles bigger while minimizing fat gain, you&rsquo;ll need to eat a high-protein diet while also including healthy fats (sorry, no pizza or burgers) and complex carbs. Bear in mind, that to build muscle you need to consume more calories per day than you burn, but if your diet is carefully monitored, you will gain mostly lean muscle mass and only small amounts of fat. To curb your appetite, try drinking 30 ounces of cold water. If that doesn&rsquo;t work, let yourself have a snack, preferably something without refined sugars.A healthy diet, for weight loss or muscle gain, is a balanced diet. If you starve <br \/>\r\nyourself to lose 10 pounds in three weeks, you&rsquo;ll just wind up damaging your body and putting the weight back on in a flash once you break your diet. Eat carbs, eat fats, eat protein, but everything in moderation. And don&rsquo;t beat yourself up when you &ldquo;stumble&rdquo;, enjoy the cookie and remind yourself how good it will feel to get back to your healthier eating later.<br \/>\r\n<br \/>\r\nIf your schedule allows it, plan on eating 4-6 meals a day instead of the usual 3. This might mean that you actually force yourself to get up and catch breakfast before the dining halls close, but you won&rsquo;t regret it! Eating these smaller-portioned meals will help you manage what you eat with greater ease as well as keep you sated throughout the day. They don&rsquo;t have to be &ldquo;full&rdquo; meals, so feel free to take a banana and a few hard-boiled eggs home from breakfast to eat as one of your meals later on.<br \/>\r\n<br \/>\r\n<b>4. Motivation<\/b><br \/>\r\n<br \/>\r\nWhether you are trying to get out of bed at 5:30am to go for a run or in the middle of a workout but completely out of steam, you need to have methods of (re)motivating yourself.<br \/>\r\n<br \/>\r\nOne method is to focus on or even visualize some goal of yours&mdash;the peanut butter, yogurt, and granola waiting back at your dorm\/d-hall, or those washboard abs that&rsquo;ll turn heads and earn envious stares.<br \/>\r\n<br \/>\r\nAnother suggestion is playing one of your favorite songs. If you feel like pumping iron to some Beethoven GO FOR IT! If Kanye or Major Lazer is more your style, that&rsquo;s cool too. And don&rsquo;t hesitate to get a little dance going in between your sets or lip-sync to Beyonc&eacute; on the elliptical.<br \/>\r\n<br \/>\r\nIf getting to the gym is the hardest part for you, then try to find a workout buddy. Having somebody to meet and another person to let down (besides yourself) is generally a pretty strong motivator.<br \/>\r\n<br \/>\r\nFrom personal experience, I have never regretted going to the gym. But I have certainly regretted the decision to take the day off and sit on my ass eating Reese&rsquo;s Puffs, though they are admittedly amazing.<br \/>\r\n<br \/>\r\n<b>5. Sleep<\/b><br \/>\r\n<br \/>\r\nGuys and gals, you need some z&rsquo;s. To burn fat, build muscle, keep energized, consolidate the memories you made while studying, or just get snuggly, you NEED TO SLEEP. Your body cannot operate at peak efficiency without sufficient sleep, and no matter what you tell yourself, you do not want to mimic your friend who hasn&rsquo;t gotten more than 3 hours of sleep a night for the past two months.<br \/>\r\n<br \/>\r\nGetting sufficient sleep will help you get that beach body you&rsquo;re aiming for, keep a positive attitude about all of your efforts, and help with academics to boot.<br \/>\r\n<br \/>\r\n<img src='pic3.jpg'>","img":"article-3.png","summary":"It&rsquo;s the beginning of March and we&rsquo;ve got t-minus two months until the summer. Maybe you&rsquo;ve put on a little insulation during the past few months&helip;","keywords":"beach body,exercise,health"}