{"img":"article-1.png","summary":"Students have their own ways of studying at Yale, but what do the top students do to achieve their stellar GPAs?","keywords":"","title": "8 Studying Tips from Phi Beta Kappa","author": "Diane Kim","date": "February 20, 2014","text":"Students have their own ways of studying at Yale, but what do the top students do to achieve their stellar GPAs? Vice president of Phi Beta Kappa, Andrew Inho Mun (ES '14), lets us in on his secrets.\r\n\t\t<br \/><br \/>\r\n\t\t<i>&ldquo;People have different priorities at Yale. At least for me, I took academics seriously at the top of my priority list. I thought that you're here to learn at this wonderful educational institution and that's pretty much the only thing expected of you. But by no means I am implying that the following will be applicable to everyone; this is what worked for me.&rdquo;<\/i> &mdash; Andrew Inho Mun (ES '14)\r\n\t\t<br \/><br \/>\r\n\t\t<b>1. Motivation is perhaps the most important factor.<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tI've had, for the most part, successful academic semesters, but I also had sophomore slumps and a first semester senior slump. What distinguished those academically successful semesters from the less successful ones was how motivated I was. Even if I was taking 5 credits with a heavy workload, if I was motivated enough, it was doable and enjoyable. Even if I was taking only 3 credits, if I was not motivated, it was rough. Yes, motivation is often outside of your control&mdash;try to find a reason to be motivated. \r\n\t\t<br \/><br \/>\r\n\t\t<b>2. Don't overwhelm yourself.<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tOne thing I do is crudely \"quantify\" each course in terms of the workload (usually based on Yale Bluebook) at the beginning of each semester. I'd adjust that rating a little bit, because some things came easier to me and some were tougher. Then I add them up. For instance, if I am taking 5 classes with an \"average\" workload, I will count the average as 3 and have a \"15 workload semester.\" And I used that number as a proxy for assessing how busy my semester will be like &mdash; and I tried not to go over 15, assuming I did all the readings. This made me always balance challenging classes with light classes. Find your own threshold.  \r\n\t\t<br \/><br \/>\r\n\t\t<b>3. Adjust workload so that you can give 100% in your classes.<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tAt least for me, I really cared about doing well in every single class I took, so in those semesters with heavy EC commitments, I would cut down coursework by strategically picking lighter\/easier courses in advance. Back to the point above, my approach is to never overwhelm myself (some other Yalies can really take on an overload of stuff and still manage to pull off... I think they are just incredible) so as to give 100% to all my classes.\r\n\t\t<br \/><br \/>\r\n\t\tOthers may care more about breadth than depth, and take more classes even though they can't give full devotion to all classes &mdash; that's totally fine too. It is just a matter of individual preferences. This is simply what I believed in and what I did.\r\n\t\t<br \/><br \/>\r\n\t\t<b>4. Don't settle for classes that don't interest you.<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tYou only get to take about 36 classes offered at Yale. That's not a lot. So make (almost) every single one of them count. Take classes that excite you. I generally try to screen out classes\/professors that do not seem right for me during the shopping period. In case you end up taking a class that seemed right for you during the initial screening but turned out to be not, dropping is an option that I encourage.\r\n\t\t<br \/><br \/>\r\n\t\t<b>5. Go to office hours<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tI do this especially at the beginning of the semester since each professor\/TA has different styles\/expectations, and you need to figure out early on what their expectations are to do well in classes. I can't emphasize this enough. More importantly, some of them will turn out to be amazing mentors and friends &mdash; which I think often is much more important than getting a good grade.\r\n\t\t<br \/><br \/>\r\n\t\t<b>6. Try to do all of your readings.<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tI always try to do all of the readings and take them seriously, but it depends. Some classes have really nice notes (I skip readings in those cases) but for the most part I took readings very seriously. Even when I could not do them on time, I would always try to catch up. \r\n\t\t<br \/><br \/>\r\n\t\t<b>7. Use online resources wisely.<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tI use them when readings get dense and when I am crunched for time. Yes, this is consistent with #6 above; I do not substitute online resource for readings. Instead, I try to obtain a summary or key points online and read those ahead to get a gist\/big picture before proceeding to read details. Some people enjoy going through that process of attempting to decipher difficult passages without any external help. You'll develop some skills by taking this approach, but it is a matter of trade&ndash;off. I don't think one way is better than the other, but if you're pressed for time, relying on online resource can be a big help. \r\n\t\t<br \/><br \/>\r\n\t\t<b>8. And for a final piece of advice: back to motivation.<\/b>\r\n\t\t<br \/><br \/>\r\n\t\tYou are a Yale student. There's a reason why you are here, you are capable. As long as you are motivated and genuinely care about classes, you're 90% there already."}