{"title":"8 Signs You Went to a Boarding School","author":"Jenny Park","date":"April 5, 2014","text":"<style>img{width:50%;}<\/style><br \/>\r\nHaving attended boarding school since the age of seven, I&rsquo;ve noticed that the boarding school experience is pretty universal. How many of these signs can you relate to? <br \/>\r\n<br \/>\r\n<b>1. You own way too many dresses and blazers.<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/oEPE3jR.jpg?1' width='50%'><br \/>\r\n<br \/>\r\nYour wardrobe exclusively becomes a mesh of JCrew, Anthropologie, Ralph Lauren, and Vineyard Vines. Girls get new dresses for every parties and dinners; guys get blazers in every pastel color. Shirts without collars, untucked shirts, and unbelted pants are unimaginable and a serious fashion faux pas. <br \/>\r\n<br \/>\r\n<b>2. You have at least one embarrassing memory with your \"advisor\".<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/BJtvtuC.jpg'><br \/>\r\n<br \/>\r\nEach student has an advisor. Not a big deal. But when this advisor, who doubles as your English teacher (or even chaplain!), walks in on you changing, breaking co-ed, or dancing in the middle of the room? That&rsquo;s just uncomfortable.  <br \/>\r\n<br \/>\r\n<b>3. Meet me at the \"area of refuge\" or some other sketchy place is just code word for &ldquo;Let's hook up&rdquo;.<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/T5K1GOK.jpg?1' width='50%'><br \/>\r\n<br \/>\r\nHooking up in places like the black photo room, an empty classroom, or even out in the woods becomes so normal. Eventually an invitation to places like the area of refuge become a code name for hook-ups. <br \/>\r\n<br \/>\r\n<b>4. You can&rsquo;t live without Hunters, Uggs, North Face, Longchamp, and Tory Burch.<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/ktUtR6L.jpg?1'><br \/>\r\n<br \/>\r\nFor each season and occasion, there is a right brand to be wearing or using. Hunters in all colors of the rainbow appear when the chance of precipitation exceeds 40%;  Uggs in all shapes and sizes appear when the temperature drops below 50F. <br \/>\r\n<br \/>\r\n<b>5. When you&rsquo;re allowed Internet access past midnight, say goodbye to sleep! <\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/s6skLaH.jpg?1'><br \/>\r\n<br \/>\r\nChances are that your boarding school didn&rsquo;t let you have Internet access whenever you wanted. In fact, the web shuts off at different times for each grade, but when that system malfunctions . . . you&rsquo;ll have no self-control until sunrise.   <br \/>\r\n<br \/>\r\n<b>6. You can make your room look spotless in less than five minutes. <\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/MzGtiZ8.jpg?1'><br \/>\r\n<br \/>\r\nWhenever there are random room searches, you stuff your clothes under your covers and kick everything on the floor into your closet. Without actually cleaning, the room looks squeaky-clean in less than five minutes. <br \/>\r\n<br \/>\r\n<b>7. You don't ever lock your door. <\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/GGikrEV.jpg?1'><br \/>\r\n<br \/>\r\nYou trust everyone in your dorm so much you never even think to lock your door. You don&rsquo;t even know where your key is until you need to turn it in at the end of school.<br \/>\r\n <br \/>\r\n<b>8. You hated it while you were there, but you miss it so much now.<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/z5uggtl.jpg?1'><br \/>\r\n<br \/>\r\nYou think you hate the food, you think you hate the dress code, and you think you hate everyone and everything there. By the time senior spring comes around, you&rsquo;re anxious to leave the damn place to go off to college, but the minute you leave, you start to realize how much you love it there. You refuse to let go of your boarding school friends. You remember only the best from it. You feel empty inside because your boarding school experience has truly made you the person you are. ","img":"http:\/\/imgur.com\/nTqkfeY.jpg","summary":"Having attended boarding school since the age of seven, I&rsquo;ve noticed that the boarding school experience is pretty universal. How many of these signs can you relate to? ","keywords":"jenny, park, boarding, school"}