{"title":"5 Ways to Get Your Beach Body Ready: The Busy Bulldog Version","author":"Aryeh Coburn-Soloway","date":"March 7, 2014","text":"    So, it&rsquo;s the beginning of March and we&rsquo;ve got t-minus two months until the summer. Maybe you&rsquo;ve put on a little &ldquo;insulation&rdquo; during the past few months and want to shed the extra layer, or maybe you just want to polish up the guns and buns to make heads turn. In any case, you&rsquo;ve probably got a tight schedule between problem sets, club meetings, and watching Netflix. So here are a few ways to make the most of your precious gym time given an extremely tight schedule:\r\n<br \/><br \/><img src='pic1.jpg'><br \/>\r\n<br \/>\r\n<b>1. High-Intensity Intervals</b><br \/>\r\nWe all have a friend or two training for a marathon. Those freaks probably run for an hour or two every day, but the rest of us are like &ldquo;ain&rsquo;t nobody got time for that&rdquo;. Want to burn off calories without putting in all that time, well try some interval training. This can be done with nearly any exercise and involves alternating between periods of high-intensity\/anaerobic activity and low-intensity activity. A sample interval routine could utilize a treadmill&rsquo;s variable speed settings as follows: 1 minute at 6.5mph alternating with 1 minute at 10mph. In general, if you decide to do high-intensity intervals, you&rsquo;ll want to limit the overall workout to about 20 minutes.<br \/>\r\n<br \/>\r\nFor a more detailed explanation of interval training: <a href='http:\/\/www.medicinenet.com\/interval_training\/article.htm'>http:\/\/www.medicinenet.com\/interval_training\/article.htm</a><br \/>\r\n<br \/>\r\n<b>2. Work your Core&mdash;With Weight!</b><br \/>\r\nIt almost goes without saying, but if your want any part of your body to get more defined, you need to exercise it. Doing a number of various abdominal exercises will help target your midsection in terms of both fat loss and definition. Just like any other muscle group, however, you need to do weighted activity in order to stress your abs to the point of growth. Instead of doing sets of 50 sit-ups, try doing sets of 15 crunches with a 10lb or 25lb plate held overhead or to your chest. Hold a light dumbbell between your feet during leg-raises, and don&rsquo;t forget those Russian Twists for obliques!<br \/><br \/><img src='pic2.png'><br \/><br \/>\r\nAll of your core efforts will be for naught unless you truly activate those muscles. Keeping this in mind, make sure that from the start position of EVERY SINGLE REPETITION you are pulling with your abdominals and not wasting your own time.<br \/>\r\n<br \/>\r\n<b>3. Max-OT</b><br \/>\r\nMax-OT, or Maximum Overload Training, is an intense weight-training program, which will minimize your time in the gym, but also blast your muscles! The workouts generally only last 30-45 minutes and rely on free weight lifts and compound exercises to focus on stabilizer muscles and maximum muscle growth. The idea is to do 4-6 repetitions per set, and do 6-9 total sets with 2-3minutes of rest between each set. Each muscle group should only be worked once per week. Minimizing your gym time should enable you to put in more days at the gym since it should be easy to &ldquo;sneak in&rdquo; 45 minutes each day.<br \/>\r\n<br \/>\r\nA sample routine: <a href='http:\/\/www.jeffwillet.com\/newsite\/training-nutrition\/workout-routine\/'>http:\/\/www.jeffwillet.com\/newsite\/training-nutrition\/workout-routine\/</a><br \/>\r\n<br \/>\r\n<b>4. Healthy Diet</b><br \/>\r\nIf you spend twelve hours in the gym a day, but wind up consuming more calories than you burn, those twelve hours will not make you any more defined. Sure, you&rsquo;ll build muscle, but if your goal is to lose weight, you need to eat fewer calories than you burn. It&rsquo;s that simple. <br \/>\r\n<br \/>\r\nIf you are interested in making your muscles bigger while minimizing fat gain, you&rsquo;ll need to eat a high-protein diet while also including healthy fats (sorry, no pizza or burgers) and complex carbs. Bear in mind, that to build muscle you need to consume more calories per day than you burn, but if your diet is carefully monitored, you will gain mostly lean muscle mass and only small amounts of fat.<br \/>\r\n<br \/>\r\nTo curb your appetite, try drinking 30oz of cold water. If that doesn&rsquo;t work, let yourself have a snack, preferably something without refined sugars.<br \/>\r\n<br \/>\r\nA healthy diet, for weight loss or muscle gain, is a balanced diet. If you starve yourself to lose 10lbs in three weeks, you&rsquo;ll just wind up damaging your body and putting the weight back on in a flash once you break your diet. Eat carbs, eat fats, eat protein, but everything in moderation. And don&rsquo;t beat yourself up when you &ldquo;stumble&rdquo;, enjoy the cookie and remind yourself how good it will feel to get back to your healthier eating later.<br \/>\r\n<br \/>\r\n<b>5. Sleep</b><br \/>\r\nGuys and gals, you need some z&rsquo;s. To burn fat, build muscle, keep energized, consolidate the memories you made while studying, or just get snuggly, you NEED TO SLEEP. Your body cannot operate at peak efficiency without sufficient sleep, and no matter what you tell yourself, you do not want to mimic your friend who hasn&rsquo;t gotten more than 3 hours of sleep a night for the past two months.<br \/>\r\n<br \/>\r\nGetting sufficient sleep will help you get that beach body you&rsquo;re aiming for, keep a positive attitude about all of your efforts, and help with academics to boot.<br \/><br \/><img src='pic3.jpg'>","img":"http://theboola.com/article-3.png","summary":"So, it&rsquo;s the beginning of March and we&rsquo;ve got t-minus two months until the summer. Maybe you&rsquo;ve put on a little &ldquo;insulation&rdquo; during the past few months&helip;","keywords":"beach,body,ready,busy"}