{"title":"How to Spend Your Summer at Yale","author":"Rebecca Su","date":"April 19, 2014","text":"1. If you&rsquo;re looking for a roommate, try asking your friends who are science majors. A lot of them are probably doing research. <br \/>\r\n2. Join the Yalies in New Haven Facebook group. It&rsquo;ll be a good way to meet up with other people! <br \/>\r\n2. Don&rsquo;t just settle on a sublet--visit a lot. That nice apartment you thought was only a block way? It&rsquo;s actually a voyage up East Rock. <br \/>\r\n3. You are not a Master Chef. Cooking your own food is difficult, stick with the simple recipes when you make that dreaded trip to Stop & Shop. <br \/>\r\n4. Actually, you&rsquo;ll probably just end up eating out. You&rsquo;ll know all of the trending restaurants by the time your friends get back. <br \/>\r\n5. If you&rsquo;re looking for a social space, go to Payne Whitney. Since there&rsquo;s nothing else to do, everyone will be working out. Make sure to look hot. <br \/>\r\n6. If you live in East Rock or down by the med school, you&rsquo;re going to need to call a SafeRide at night. Be nice to the guys who drive the SafeRide shuttles; you&rsquo;ll see them every night. <br \/>\r\n7. Toads is actually open over the summer, but they have the worst groups performing. Good thing there are better alternatives: The Yale Undergraduate Society for Biological Sciences is hosting a &lsquo;Dress Up As Your Research Project&rsquo; party. <br \/>\r\n8. Warning: campus will be filled with privileged high school students. Try to avoid them unless you need to get into a college; they&rsquo;ve all got swipe access.<br \/>\r\n9. You&rsquo;ll probably want to kill yourself if you stay in New Haven for too long, so make sure to get out! Day trips to New York, Boston, or even to the beach will restore your sanity. ","img":"http:\/\/i.imgur.com\/AfeGsrF.jpg","summary":"Staying in New Haven over the summer? Here are the things you need to know!","keywords":"new haven, summer"}