{"title":"What I Wish I Hadn't Known at Bulldog Days","author":"Karin Shedd","date":"April 19, 2014","text":"Reminiscing on a former lack of knowledge is a proud tradition of people who like to share their thoughts on the Internet. For those of us who like to neurotically pregame life through our computer screens, &ldquo;things I wish I had known&rdquo; articles and videos exist for virtually any topic, like marriage, prom, different phases of being a twentysomething, making your sexual debut, and, most relevantly to any prefrosh reading this, what to know before entering college.<br \/>\r\n<br \/>\r\nBut, as I learned at my own Bulldog Days three years ago, knowledge of things can also lead to crushing disappointment, awkward situations, and decisions you don&rsquo;t know how to make. As one of the aforementioned people who likes sharing their thoughts on the internet and in an attempt to assist you, dear prefrosh, here is a list of those things and why I wish I hadn&rsquo;t known about them three years ago.<br \/>\r\n<br \/>\r\n<b>1. What College Confidential Was<\/b><br \/>\r\n<br \/>\r\nIf you somehow managed to avoid desperately Google-searching something like &ldquo;will I get into Yale???&rdquo; during your application season, allow me to explain. Collegeconfidential.com is the cesspool of narcissism and panic where uppity applicants and\/or their helicopter parents congregate to post their &ldquo;stats&rdquo; (standardized test scores, GPAs, and extracurricular activities), propagate culturally-insensitive myths about the admissions process (&ldquo;my friend faked being 1\/32 Cherokee and got in to all the ivies!&rdquo;), and, after admissions day, masturbate their egos under the guise of humility (&ldquo;I&rsquo;m so surprised I got in, lol sorry plebs who didn&rsquo;t&rdquo;).<br \/>\r\n<br \/>\r\nDon&rsquo;t let College Confidential and its cohorts (looking at you, Yahoo answers) trick you into thinking you&rsquo;re a subpar prefrosh surrounded by Olympic athletes\/chess masters\/founders of successful charities with perfect SAT scores, more interesting ethnicities, and application essays featured in The New Yorker. That&rsquo;s only, like, half of them. The rest are just like you!<br \/>\r\n<br \/>\r\n<img src='http:\/\/cdn.makeagif.com\/media\/4-14-2014\/zx9P7Q.gif'><br \/>\r\n<br \/>\r\n<b>2. What Princess Suites Were<\/b><br \/>\r\n<br \/>\r\nDorms at Yale are nice. Really nice. Anyone who tries to tell you differently is lying and should take a sabbatical in which they visit literally any other campus in the US to realize how wrong they are.<br \/>\r\n<br \/>\r\n<img src='http:\/\/themissouritorch.com\/wp-content\/uploads\/2014\/04\/wrong1.gif'><br \/>\r\n<br \/>\r\nThe nicest of the nice for freshmen dorms are the princess suites. These palatial estates are inhabited by ten lucky Davenport freshwomen and include a staircase, a sprawling common room, an in-suite bathroom, and an inability to relate to the sad, suffering plebeians living elsewhere. Think of the princess suites as Gatsby&rsquo;s pad.<br \/>\r\nOn the opposite end of the spectrum is homely little Lanman-Wright hall, or Ldub for short. Ldub is inhabited by unfortunate freshpeople in Berkeley and Pierson, and non-freshpeople roommates include mice, cockroaches, and frocos who question why they decided to move back there in the first place. Think of this as a shittier version of Nick Carraway&rsquo;s humble cottage, plus cockroaches.<br \/>\r\nLiving in Ldub turned out to be fine in the end, and those who live there now might tell you they love it. Whether this is a coping-mechanism or an undiagnosed case of Stockholm syndrome is unclear &ndash; all I&rsquo;m saying is don&rsquo;t get your hopes up, prefrosh. If you&rsquo;re not staying in a princess suite, avoid them so as to not give yourself false hope. If you&rsquo;re already settled in . . . just start praying you&rsquo;ll avoid the atomic bomb of disappointment that is getting sorted into Ldub after experiencing Yale&rsquo;s most eccentric freshmen suites.<br \/>\r\n<br \/>\r\n<img src='http:\/\/www.reactiongifs.com\/r\/hz2.gif'><br \/>\r\n<i>Me, upon realizing I&rsquo;d spend a year living in LdubÂ\u0085<\/i><br \/>\r\n<br \/>\r\n<br \/>\r\n<b>3. How Gilmore Girls Portrayed Life at Yale<\/b><br \/>\r\n<br \/>\r\nImportant disclaimer: Gilmore Girls remains one of my favorite shows of all time. <br \/>\r\nThat being said, if you&rsquo;re coming to Yale hoping to be the next Rory Gilmore, go ahead and let go of that pipe dream right now. How Rory lives her television life at Yale and how life at Yale actually is are two entirely separate things. It&rsquo;s simply not possible to emulate our favorite fictional Yalie for a plethora of different reasons:<br \/>\r\na. The city of New Haven exists here in reality, unlike in the Gilmore universe. Embrace it.<br \/>\r\nb. Coffee carts will not appear right outside your dorm room. It might be a taco cart or a kettle corn cart, though, if you live in Trumbull, Saybrook, or Berkeley!<br \/>\r\nc. Freshmen who live in Durfee are in Morse, not Branford (but Robert Frost really did say that bit about Branford being the oldest and most beautiful at Yale).<br \/>\r\nd. No one looks as put-together as Rory Gilmore all the time. Even the best-dressed people you meet will occasionally inhabit a Bass Library cubicle in their schlumpiest sweatpants.<br \/>\r\ne. It is absolutely impossible to take off a full semester, be the editor of the Yale Daily News, maintain a successful years-long committed relationship, infiltrate Skull and Bones, spend every Friday night dinner in Hartford, and still graduate with honors on time all in one career at Yale.<br \/>\r\n<br \/>\r\nBut don&rsquo;t despair, Gilmore fans! There are still ways to emulate your favorite Gilmore plotlines, like freaking out over old books and hosting your own prefrosh. Most importantly, it&rsquo;s absolutely possible to find your own Logan Huntzberger, crash one of his family yacht parties, steal a yacht, and get arrested for grand-theft boating! Those people definitely exist here, you just have to find them. Maybe check the frat houses? I don&rsquo;t know.<br \/>\r\n<br \/>\r\n<img src='http:\/\/cdn4.gurl.com\/wp-content\/uploads\/2013\/06\/gilmoregirlsgif.gif'> <br \/>\r\n<i>And, ideally, that person has a yacht.<\/i><br \/>\r\n<br \/>\r\n<b>4. The Existence of Disney Parties<\/b><br \/>\r\n<br \/>\r\nSomeday, prefrosh, you might receive an anonymous email inviting you to a Disney party. They&rsquo;re a whole new world, these Disney parties. They exist not just around the riverbend, but, rather, in an off-campus house. They won&rsquo;t teach you to paint with all the colors of the wind, you probably won&rsquo;t get to kiss the girl, and they likely won&rsquo;t make a man out of you, so you need to be prepared for that. If you just can&rsquo;t wait to be king of the social scene, you could try to go the distance to attend a Disney party, but to the rest of you: just let it go. Let it go, let it go, turn away and slam the door . . . on the idea of a Disney party.<br \/>\r\n<br \/>\r\n<img src='http:\/\/29.media.tumblr.com\/tumblr_liqmx5OkNx1qadlzho1_500.gif'> <br \/>\r\n<i>It was a naked party. That&rsquo;s what it was. A naked party. Maybe leave that until your freshmen year, at least.<\/i><br \/>\r\n<br \/>\r\n<b>5. Fraternities<\/b><br \/>\r\n<br \/>\r\nConfession: I&rsquo;m still unsure about this one. Do I wish I had known a brave soul who would have taken me to a fraternity, or do I wish I hadn&rsquo;t known about them at all so I wouldn&rsquo;t have to debate about it all weekend?<br \/>\r\n<br \/>\r\nIf you&rsquo;re like I was during Bulldog Days, you&rsquo;re probably too busy shitting your pants with shock and awe that you&rsquo;re here to have time to go to any parties (also you&rsquo;re too shy and awkward, and that&rsquo;s okay). Three years later, though, I still only know where one frat house is because of that one tragicomical night I spent chasing down an unrequited love interest. How would my Yale career be different if I had incorporated frats into my lifestyle from the very beginning? I don&rsquo;t know. I have no advice for you on this one, prefrosh. You&rsquo;re on your own.<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/y2Zwk.gif'> <br \/>\r\n<i>Idk, frats?<\/i>","img":"http:\/\/nyulocal.com\/wp-content\/uploads\/2012\/02\/college-freshman.jpeg ","summary":"Dear prefrosh, all the information you need is below: this is the definitive guide to the knowledge we all wish we&rsquo;d had (or not) during BDD.","keywords":"bulldog days, prefrosh"}