{"title":"15 Things I Wish I Had Known About Bulldog Days","author":"Boola Staff","date":"April 21, 2014","text":"1. If your host looks a little stressed, know that its finals week. <br \/>\r\n2. Do not touch the golden foot. I know they say it&rsquo;s a tradition, but trust us on this. <br \/>\r\n3. You <span style=\"text-decoration: line-through\">might<\/span> will never see the gazillion people you meet ever again. <br \/>\r\n4. The political groups are one of the few organizations that will be serving alcohol. <br \/>\r\n5. There are better places to eat than Claire&rsquo;s Cornercopia. Or Yorkside.<br \/>\r\n6. You will have future opportunities to go to these events. <br \/>\r\n7. Nobody cares about your SAT score now that you&rsquo;ve been admitted. <br \/>\r\n8. Similarly, nobody cares how many schools accepted you.  Harvard sucks, Princeton doesn&rsquo;t really matter.  You&rsquo;re at Yale, we only care about bulldogs and blue.<br \/>\r\n9. Everyone knows you&rsquo;re a prefrosh. <br \/>\r\n10. Seniors are not actually interested in what you&rsquo;re wearing to high school prom, they&rsquo;re just trying to complete their 8 year challenge.<br \/>\r\n11. Be courteous and let your host know what your plans are for the night, so they&rsquo;re not freaking out at 4am. <br \/>\r\n12. If you&rsquo;re from the midwest, trains in New England don&rsquo;t just transport cows and local agriculture. They carry people too!<br \/>\r\n13. Come to the Davenport Dive to eat good food (and watch members of Yale&rsquo;s finest dance group twerk on tables)<br \/>\r\n14. Sit in on classes.  See if your host can sneak you into a seminar- they tend to be a lot more interesting than lectures.<br \/>\r\n15. Enjoy the weather while it lasts; it&rsquo;s never really this good.","img":"http:\/\/i.imgur.com\/OmINZiU.jpg","summary":"Ah, Bulldog Days. Prefrosh swarm around campus eager to take in everything that is Yale before they finish their last few weeks as high school students. With events and tours and bazaars all lined up in their schedule, Bulldog Days can get overwhelming. If we could go back in time, there are quite a few things we would have done differently\u0085","keywords":"bulldog days, prefrosh"}