{"title":"My Final Night at Feb Club","author":"Maggie Green ","date":"March 24, 2014","text":"Feb Club, a long-standing Yale tradition was started by wonderful, upstanding students Doug Green, Dave Bass, Andy Haas, Gary Sweeney, Jim Burnham, and Steve Fox in Room 685 (lol what?) of JE in 1975 (Source: the comment from my dad on a Facebook wall post I left him in February 2013).<br \/>\r\n<br \/>\r\n<b>Original All-Star wearing original Feb Club required attire.<\/b><br \/>\r\n<img src='undefined'><br \/>\r\n<small><i>Source: facebook.com<\/i><\/small><br \/>\r\n<br \/>\r\nBack in the day, these fine men that are now leading the free world decided that February deserved to be a whole lot drunker, and set up the February club.  There were no stickers, no entrance fees, and people of all class years could partake.  Oh, what a time to be alive!<br \/>\r\n<br \/>\r\nPoint is, Feb club has evolved a lot since back in the day.  I don&rsquo;t pretend to be one of the infamous All-Stars, but I have been (both with a sticker and without) to my fair share of these raucous events.  Or rather, events that I wish were a lot more raucous.<br \/>\r\n<br \/>\r\nOf course, any self-respecting senior wouldn&rsquo;t miss the last day of this wonderful month.  After 28 days of seeing the same people again and again, there is nothing you want to do more than buy 100 shots and proceed to throw one into each of their faces.<br \/>\r\n<br \/>\r\n<b>&ldquo;Rude.&rdquo;<\/b><br \/>\r\n<img src='undefined'><br \/>\r\nSource: tumblr.com<br \/>\r\n<br \/>\r\nHere&rsquo;s my play-by-play of the final night:<br \/>\r\n<br \/>\r\n10:00pm: Begin pregame, aka drinking PBRs alone in my room while blasting Ke$ha and Queen Bey and applying mascara.  It&rsquo;s hard out here for a SWUG.<br \/>\r\n&ldquo;Your man ain&rsquo;t never seen a booty like this.&rdquo;<br \/>\r\nSource: tumblr.com<br \/>\r\n<br \/>\r\n10:45pm: Sprint to friend&rsquo;s room to indulge in more beer and make fun of him in his already intoxicated state.<br \/>\r\n<br \/>\r\n10:52pm: First booty text of the night: sent.<br \/>\r\n<br \/>\r\n11:15pm: Arrive at the door of the Russian Lady.  Flirt with Security Guards unnecessarily because I have all of the necessary credentials to enter.  God it sucks being old and within the law.<br \/>\r\n<br \/>\r\n11:16pm: Hug attacked by every person in the room.  I can&rsquo;t help it that I&rsquo;m popular.<br \/>\r\n<br \/>\r\nAll my bitches love me.<br \/>\r\nSource: tumblr.com<br \/>\r\n<br \/>\r\n11:19pm: Wait at bar for attention and alcohol.<br \/>\r\n<br \/>\r\n11:32pm: Still waiting for alcohol.<br \/>\r\n<br \/>\r\n11:35pm: God fucking damn it look at me I need a Long Island.<br \/>\r\n<br \/>\r\nActual footage of me trying to get the bartender&rsquo;s attention.<br \/>\r\nSource: tumblr.com<br \/>\r\n<br \/>\r\n11:37pm: Denied Long Island and Whiskey Sour&hellip;so settled on Tequila Sunrise.<br \/>\r\n<br \/>\r\n11:38pm:  Holy shit what is in this drink and why do I suddenly want to have sex with everything.<br \/>\r\n<br \/>\r\n11:40pm:  Hi friend!  Oh, we&rsquo;re not friends?  Too bad we are now let&rsquo;s hug.<br \/>\r\n<br \/>\r\n11:41pm: Second booty text of the night: sent.<br \/>\r\n<br \/>\r\n11:44pm: Where  fuck did my friends???  Who this person I&rsquo;m talking to?<br \/>\r\n<br \/>\r\n11:45pm: Bye, rando. DANCE FLOOR. <br \/>\r\n<br \/>\r\n#dueces<br \/>\r\nSource: tumblr.com<br \/>\r\n<br \/>\r\n11:48pm: Oh look actual friend!  With alcohol!  Yes I take Long Island iced tea now thank you bye.<br \/>\r\n<br \/>\r\n11:52pm: I JUST WANNA DANCE AND BE FREE<br \/>\r\n<br \/>\r\nMe dancin wit ur gurl<br \/>\r\nSource: tumblr.com<br \/>\r\n<br \/>\r\n11:54pm:  &ldquo;IIII JUST WANNA DANCE WITH SOMEBODY.  I WANNA FEEL THE HEAT FROM SOMEBODY.&rdquo;<br \/>\r\n\t&ldquo;Maggie, that&rsquo;s not the song playing.&rdquo;<br \/>\r\n\t&ldquo;SHUT THE FUCK UP.&rdquo;<br \/>\r\n<br \/>\r\n12:07am: More Long Island?  YES PLS.<br \/>\r\n<br \/>\r\n12:15am: How talk what is sentences.  Speak through awkward dancing.<br \/>\r\n<br \/>\r\nI think we all know what this means.<br \/>\r\nSource: tumblr.com<br \/>\r\n<br \/>\r\n12:32am:  When did I home? Where is&hellip;.oh look bed!  Goodnight world, and goodbye feb club.<br \/>\r\n<br \/>\r\nFun fact, I still haven&rsquo;t woken up from that night.<br \/>\r\n<br \/>\r\nSource: tumblr.com<br \/>\r\n","img":"http:\/\/www.boakart.com\/graphics\/febclub\/FebClub-sm-Morys.jpg","summary":"February: a miserable and dreary month for most of Yale.  But for seniors, this is a miserable and dreary month filled with an impossible amount of alcohol. Join me on my play-by-play account of my final night at Feb Club. ","keywords":"Maggie Green, My Final Night at Feb Club, Boola"}