{"title":"piece of crap","author":"Aryeh Coburn-Soloway","date":"March 24, 2014","text":"Time to beat the dead horse that is Yale&rsquo;s romantic\/sexual\/relationship-y\/hookup culture. Hopefully we&rsquo;ll be able to squeeze a little new insight out of this topic by discussing some things that are usually unspoken. Although I was in a long-distance relationship from Day 1 of Camp Yale up until this past November, I have a definite opinion on the method by which many (if not most) Yalies get some intimate contact. I have now had some firsthand experience of the single life as well as had dozens of deep conversations about romantic life on campus with people from many points on Yale&rsquo;s spectrum. <br \/>\r\n<br \/>\r\n<b> &ldquo;Shocker&rdquo; Number 1: DON&rsquo;T Be A Coward <\/b><br \/>\r\n<br \/>\r\nFor many of those who are not in relationships but want to be, the main obstacle is <b> you&rsquo;re acting like cowards. <\/b> Yeah, shots fired, boom-boom. But seriously, whether it is a conscious fear (of rejection, screwing up a friendship, opening up to somebody, talking to strangers for more than 45 seconds, etc.) or a subconscious fear, the odds are that you are held back by anxiety. <br \/>\r\n<br \/>\r\nIf you have any desire to connect with another person on an intimate, soul-touching level, don&rsquo;t make excuses like &ldquo;oh, I just want to focus on my studies while at Yale,&rdquo; and don&rsquo;t think that there&rsquo;s nobody here for you just because you haven&rsquo;t found that person yet. <br \/>\r\n<br \/>\r\nGet out of your comfort zone. <b> The best, and perhaps only, way to grow as a person is to do things that you aren&rsquo;t used to doing. <\/b> Yeah, shit might hit the fan, and you might get slapped or even worse straight-up laughed at. However, good things happen to people willing to take risks. Put yourself out there, and regardless of the result, you&rsquo;ll have earned major &ldquo;cojones-points&rdquo;.<br \/>\r\n<br \/>\r\nSince this isn&rsquo;t a Yale-exclusive phenomenon, I hope you&rsquo;ll forgive me for talking about events that occurred outside of the &lsquo;Have. <br \/>\r\n<br \/>\r\nThrough the first three years of high school I had one really good friend who was a girl. We talked nearly every day, did track & field together, and hung out outside of school. I had the biggest crush on her, and never said a word out of fear that she would reject me. <br \/>\r\n<br \/>\r\nSenior year, I met another girl outside of school and after hanging out a few times I told her that I really liked her and would like to date her if she was down. That&rsquo;s the short, simple version of how I started dating my ex, while the full version involves my friend&rsquo;s basement, tequila, spin the bottle, and a near-orgy\u0085 A couple months later while hanging with my other friend, she told me that she had wanted to go out with me for almost two years. <br \/>\r\n<br \/>\r\nMoral of the story: If I had the courage to express my feelings I could&rsquo;ve had a wonderful relationship with my friend, but I let my fear hold me back. When I did tell somebody (my ex) how I felt about them, things worked out well and I have no regrets about any of the time\/energy spent cultivating that relationship.<br \/>\r\n<br \/>\r\n<b> Revelation Numba 2: DON&rsquo;T let your past dictate the future <\/b><br \/>\r\n<br \/>\r\nA lot of guys here, straight, gay, bi, whatever, want to do more than have a one-night stand or a short string of hookups. Not all of them do, but many are at least interested in testing out the waters of Relationship Pond (it&rsquo;s a lovely place full of sunshine, dragonflies, and wine-carrying cherubs). <br \/>\r\n<br \/>\r\nDuring freshman fall and even spring a lot of people wind up going through HUGE amounts of personal development, though there&rsquo;s a lot more left to be explored. At some point, many guys who came in with the attitude of slaying as much poontang as possible decide that they&rsquo;re ready to try something else out. <br \/>\r\n<br \/>\r\nAfter jumping into a particular social circle and type of relationships, however, it can be damn hard to change how you approach things and are perceived. For instance, a number of friends of mine have developed a certain reputation\/infamy\/aura that each feels is nearly inescapable. How do you get a cutie from section to go out to dinner with you when he\/she knows you to be a one-nighter kind of person? <br \/>\r\n<br \/>\r\nIt&rsquo;s easy enough to come to terms with something yourself and change it, but certainly more daunting to get others to see you in a new light. You have to put in the effort to develop some new friends and\/or maintain your new persona long enough that people notice and accept the change.<br \/>\r\n<br \/>\r\nIf they&rsquo;re worthy of the title, friends will accept your new love\/sex life after an acclimation period &mdash; change often begets change, and it&rsquo;s a lot of fun to grow and mature with your friends. You can all laugh at the times you used to wake up naked and phoneless in strange rooms and appreciate the new path you&rsquo;ve taken, whether you decide to date seriously, explore your sexuality, or take a vow of abstinence. In any case, you will strengthen the ties of friendship already in place as you each further develop your individual identities.<br \/>\r\n<br \/>\r\n<b> You don&rsquo;t need New Year&rsquo;s to come around before you make a resolution to change the way you approach romance at Yale, you just need the will to make the change and follow through with it ( easier said than done). <\/b><br \/>\r\n<br \/>\r\nObviously, as someone who was in a relationship for almost 3 semesters, the image that many people had of me was inextricably linked to my SO. After the break-up, I felt I had a few choices: wall myself off from all intimacy at college, try to find another serious relationship, or go around with Nelly Furtado&rsquo;s &ldquo;Promiscuous&rdquo; as my anthem. <br \/>\r\n<br \/>\r\nI decided on the last of the options, and wound up making out with some stranger at Woads two days after ending my relationship. Mid-makeout I realized I wasn&rsquo;t really ready to try and take things further, so after the song ended I grunted something along the lines of &ldquo;need bathroom&rdquo; and bailed. <br \/>\r\n<br \/>\r\nIt&rsquo;s been 5 months after my breakup. I certainly no longer identify as a &ldquo;relationship guy&rdquo;, and while I&rsquo;m not gonna complain if Aphrodite drops out of the sky (or more likely jumps off Toad&rsquo;s stage) and sweeps me off my feet, I am much more of a &ldquo;hookup guy&rdquo; at this point. My friends have gotten used to my changed attitude and now we can all bond over coming back to the suite accompanied by amazingly hot G-heav sandwiches in place of hookups. <br \/>\r\n  <br \/>\r\n<b> 3rd and final proverbial bomb: DO have casual first dates <\/b><br \/>\r\n<br \/>\r\n&ldquo;True&rdquo; first dates are zero-pressure, zero-commitment, and should be like dipping your toe into a cold lake before deciding whether or not to dive in. Be up-front with your intentions\/interests (gotta first get over the fear-hurdle talked about previously) and assuming you are successful in securing a coffee-date or private study session just use it as an opportunity to learn more about the other person. <br \/>\r\n<br \/>\r\nIt doesn&rsquo;t matter whether you&rsquo;ve drunkenly hooked up or only talked to each other in section&mdash; <b> use the first date to see if there&rsquo;s any chemistry. <\/b> If you guys know one another well, then even if the date is a disaster, you can both laugh about it together. If you don&rsquo;t know one another, then you can laugh\/cry about it with your friends individually. <br \/>\r\n<br \/>\r\nEssentially, &ldquo;true&rdquo; first dates shouldn&rsquo;t be a big deal at all. They should be casual enough that you can laugh about them when they go horribly wrong and short enough that you don&rsquo;t run out of things to talk about. Don&rsquo;t be afraid of agreeing to get coffee with the shy, but cute guy in your Orgo section, or going to Chipotle with the chick you had a great time with at Screw.<br \/>\r\n<br \/>\r\nOver spring break I wound up getting asked out by my little siblings&rsquo; babysitter. I admit that I was a little concerned that awkward situations could arise in the future, but after walking around with her, talking and enjoying gourmet popsicles, I found myself having a lot of fun. It quickly became clear to me that while she took me to her apartment to meet her cat (no, that&rsquo;s not a euphemism), she had no intention of pushing our relationship beyond friendship that day.<br \/>\r\n<br \/>\r\nRegardless of my initial hesitations and worries, I&rsquo;m glad that I decided to meet up with her, and plan to do similarly fun and casual things with people I&rsquo;m interested in here at Yale. A quick clarification: regardless of what you define it as a &ldquo;date&rdquo;, pick activities that are innocent enough that you could do them with a totally platonic friend OR somebody in whom you are interested in.<br \/>\r\n<br \/>\r\nObviously this article barely scratches the surface of the complex emotional and social web that is romance at Yale, but hopefully this gives you one or two useful insights. I hope that actually putting these thoughts out in the open, in written form, can help start changing the stigma associated with dating at Yale.<br \/>\r\n<br \/>\r\n<b> Tell us about your dating experience in the comments section below! <\/b><br \/>\r\n","img":"http:\/\/www.digitaltrends.com\/wp-content\/uploads\/2013\/03\/online-dating-header2.jpg","summary":"Read my advice on things you should and should not do when dating at Yale! ","keywords":"random keywords"}