{"title":"6 Fun New Haven Dining Options ","author":"Diane Kim","date":"March 23, 2014","text":"When I first stepped foot into the land of New Haven, a city so well-known for top-rated restaurants, my inner Californinan food junkie, well, died. Where was the rich, stanky aroma of Pho? The waft of sizzling meat-on-meat at All You Can Eat Korean BBQ? The chunky Animal sauce of In-N-Out burgers? WHERE WAS TACO TUESDAY?<br \/>\r\n<br \/>\r\nNow that it&rsquo;s been two years, I&rsquo;ve realized that California is not, in fact, the rest of the world, and I&rsquo;ve come to appreciate the quirks of New Haven dining. I know many Yalies, especially those on the meal plan, have yet to venture past the weekly routines of Yorkside pizza, froyo, Wenzels, and Gheav sandwiches. But let&rsquo;s live a little and get away from the grind. Why not grab a few friends and try something different and mouth-wateringly delicious?  Make your next club bonding event an experience obsessing over food. Surprise your significant other with something a little more creative than an Insomnia run. <br \/>\r\n<br \/>\r\nI present to you my guide for fun dining:<br \/>\r\n<br \/>\r\n<br \/>\r\n<b>1. Go on a hotpot and dimsum outing at The Great Wall of China.<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/d5o0QZk.png'><br \/>\r\n<i>Source: greatwallofchina.com<\/i><br \/>\r\n<br \/>\r\nGreat Wall is hands down my favorite Chinese restaurant in New Haven. (Sorry Chaochao, you&rsquo;ll never sway me.) And while you could probably end up with a fantastic meal picking a menu item blindfolded, the hotpot is their specialty. For those new to this &ldquo;cooking your meat&rdquo; on the spot system, you can choose a variety of ingredients to throw into a delicious &ldquo;hot pot&rdquo; that cooks everything together: spicy\/non-spicy broth, meats, seafood, dumplings, vegetables, whatever you want. Yummm. Great Wall also does the best dimsum. Trust me&mdash;I&rsquo;ve experimented way too much with this. Entire carts of tiny plates come and go for you to choose from; pick a few dishes and see what you like!<br \/>\r\n<br \/>\r\nTIP: Best dimsum comes out for lunch on the weekends. This is really not a secret; the restaurant is packed during this time so make sure to get there early!<br \/>\r\n<br \/>\r\n<br \/>\r\n<b>2. Skip the meals and go for dessert and tea at Union League.<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/A6zfSbi.jpg'><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/ILUNQ6E.jpg'><br \/>\r\n<i>Source: Diane Kim<\/i><br \/>\r\n<br \/>\r\nI admit: I&rsquo;m not sophisticated enough to truly appreciate fine French cuisine. Last time I ordered their bouillabaisse, it tasted like a subpar version of my mom&rsquo;s seafood stew, double the price. But I will say that the dessert options always blow me away. Everything on the dessert menu is 11.75 and beautifully crafted with an assortment of vanilla, chocolate, sorbet, and fruity dishes. Order a coffee\/tea and get ready to take some Instagram worthy photos. Despite the small size, the desserts are surprisingly filling, and the beautiful setting of Union League will complete the experience.  <br \/>\r\n<br \/>\r\nTIP: The pictures above is from my latest Union League excursion. The left shows the Chaud-Froid Choco-Vanille: crispy chocolate leaves that are actually perfection. The right is the Napoleon Choco-Pistache, a must for any diehard pistachio fans aka me.<br \/>\r\n<br \/>\r\n<br \/>\r\n<b>3. Get Latin with traditional tamales at Rubamaba.<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/gilbV9r.jpg'><br \/>\r\n<i>Source: rubamba.com<\/i><br \/>\r\n<br \/>\r\nGod, it&rsquo;s been so hard to find quality Mexican food. I sort of gave up after trying the nachos at Claire&rsquo;s. (I know, why would that ever be a good idea?) But ever since I was introduced to the Rubamba truck on York, I&rsquo;ve regained hope. Columbian food is equally as delicious and these authentic tamales only served on Saturdays prove it. Try it with traditional drinks like Jamaica or Horchata and order their corn on the side. <br \/>\r\n<br \/>\r\nTIP: Take a fresh, homemade salsa to-go while you&rsquo;re at it. You&rsquo;ll never be able to go back to those artificial Tostitos jars at Durfees.<br \/>\r\n<br \/>\r\n<br \/>\r\n<b>4. Make your own pizza at Zinc.<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/8Xg6kWx.png'><br \/>\r\n<i>Source: newhaveneats.wordpress.com<\/i><br \/>\r\n<br \/>\r\nSkip all the fancy stuff and go straight to Kitchen Zinc through an alleyway with a trippy design that incorporates the back parking lot. Once you go past the entrance of thick, velvet curtains, you&rsquo;ll be invited to a cozy atmosphere where you can make crazy combinations by personalizing your pizza. Where else would you get toppings like Ricotta Salata Cheese, Blue Crab, and Pickled Jalapeno?<br \/>\r\n<br \/>\r\nTIP: Complete the experience by coming in during Happy Hour (Mon-Thurs 5-7pm, Fri-Sat 9-11pm) and pair your pizza with $3\/$4 draft beer.<br \/>\r\n<br \/>\r\n<br \/>\r\n<b>5. Order every flavor of wings at Buffalo Wild Wings<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/b3XTEdM.png'><br \/>\r\n<i>Source: thevictoryformation.com<\/i><br \/>\r\n<br \/>\r\nThe best thing to order at BWW are obviously the wings, but you only get 6 for each flavor. The Wings Challenge is best done with a group of 15+ people, but the idea is to order a serving of wings for all 22 different flavors, or as many different flavors as you can. This lets you sample wings from exotic flavors like Caribbean Jerk that you might not want all for yourself; it&rsquo;s also a great way to make conversation with your peers. You can ask people to guess which flavor they&rsquo;re trying or rave about your newest favorite (it&rsquo;s how I discovered Mango Habanero).<br \/>\r\n<br \/>\r\nTIP: Always get their hottest flavor Blazin. The spiciness sneaks up on you a little after you start thinking &ldquo;this ain&rsquo;t so bad&rdquo;, and the ensuing face-numbing fire and milk-chugging chaos are definitely experiences you&rsquo;ll never forget.<br \/>\r\n<br \/>\r\n<br \/>\r\n<b>6. For the hibachi newbie, check out Kumo Hibachi<\/b><br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/CMBL8LL.jpg'><br \/>\r\n<i>Source: local.ctpost.com<\/i><br \/>\r\n<br \/>\r\nFor those new to the hibachi scene, hibachi is basically where a chef cooks your food on a grill right in front of you. This is cool because they&rsquo;re trained to make it a performance by showcasing onion ring volcanos, egg tosses, and talking happy facesÃ\u0083Â\u0083Ã\u0082Â\u0082Ã\u0083Â\u0082Ã\u0082Â\u0085you&rsquo;ll see. You start off choosing some sort of meat, chicken, or seafood and they&rsquo;ll flavor that baby up with fried rice and vegetables. I say newbie because once you know all the tricks, it gets bland, especially if you&rsquo;ve been to higher end hibachi places. But definitely worth a one-time trip, and definitely a memorable dining experience!<br \/>\r\n<br \/>\r\nTIP: The cheapest hibachi meals you&rsquo;re going to get are either a Vegetable ($17) or a Chicken ($19) which both taste fine. On the flip side, sushi is half price for dinner, which means you get rolls for $2-$3, woohoo!<br \/>\r\n<br \/>\r\n<br \/>\r\n<b>Share your own fun dining experiences in the comments section below!<\/b>","img":"http:\/\/i.imgur.com\/oelLRDm.jpg","summary":"Sick of your weekly routine of Yorkside pizza, froyo, and Wenzels? Check out these fresh New Haven dining options for you and your friends! ","keywords":"food,new haven,union league,rubamaba,great wall of china,zinc,buffalo wild wings,kumo hibachi"}