{"title":"Are You a Payne Whitney Gym-Rat?","author":"Aryeh Coburn-Soloway","date":"April 5, 2014","text":"Yale&rsquo;s student body is pretty darn active as a whole. Whether you play a varsity sport, frequent the IM fields, or run up\/down Science Hill twice a day in between classes, many of us enjoy the benefits of rigorous physical activity. But, how do you see yourself? Do you consider yourself a gym-rat? Do you feel that climbing the three stairs to your first-floor room constitutes enough muscle exertion on a daily basis?<br \/>\r\n<br \/>\r\nTake this quiz to see whether you take working out a little too seriously . . . or not seriously enough. <br \/>\r\n<br \/>\r\n<b>1. If You Know the Singlet Guy . . . +1<\/b><br \/>\r\n<br \/>\r\nIf you no longer do a double-take when he walks into Payne Whitney&rsquo;s 4th floor gym, take a point! Singlet-Guy is a short, bald man with glasses who wears a one-piece American flag wrestling singlet every time he works out. Oh, and he&rsquo;s EXTREMELY RIPPED! Like, HOLY SHIT dude&rsquo;s at bodybuilder level. There&rsquo;s been some speculation about roid-usage, but we&rsquo;re not going to address that here.<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/ive3ohN.jpg?1' width='50%'><br \/>\r\n<br \/>\r\n<b>2. If You Take the Elevator . . . -1<\/b><br \/>\r\n<br \/>\r\n&ldquo;Dude, the gym&rsquo;s all the way up on the 4th floor, and I&rsquo;m about to bust 10 miles out on the treadmill and do 100 bodyweight squat . . . not about to use my legs for an extra 30 seconds.&rdquo; - Anonymous Bro<br \/>\r\n<br \/>\r\nBut if you DO take the stairs, for reasons beyond trying to impress the cute chicks waiting for the elevator, then props!<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/9KEA4JH.jpg?1'><br \/>\r\n<br \/>\r\n<b>3. If You Have Protein in Your Bottle . . .+1<\/b><br \/>\r\n<br \/>\r\nIf you&rsquo;ve ever been to Payne Whitney to workout, a fair portion of gym-goers have some kind of bottle nearby. What defines a true fitness freak is when it&rsquo;s not water, gatorade, or soda in the bottle, but a shake with 20-50 grams of protein. Keeping a shake in the cubbies that&rsquo;s ready to go after you exercise will significantly improve both your recovery time and your gains since the optimal time for protein absorption is 15-45 minutes following a workout. Side note: Clean your damn bottles (for everyone&rsquo;s sake, but mostly your own)<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/rsbf1MH.jpg?1'><br \/>\r\n<br \/>\r\n<b>4. If You Stay In When It Snows\/Rains . . . -1<\/b><br \/>\r\n<br \/>\r\nIf the weather outside is frightful <br \/>\r\nYour bed appears delightful<br \/>\r\nAnd you really don&rsquo;t want to go<br \/>\r\nTake it slow! Let it go! . . . You get the point. <br \/>\r\n<br \/>\r\nWith your residential college gym right below you, making the trek to Payne Whitney in less than optimal weather conditions is brutal, but a sure sign of loyalty. <br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/b6iDhT4.jpg?1'><br \/>\r\n<br \/>\r\n<b>5. If You Can&rsquo;t Find The Weight-Collars & Cable Attachments . . . -1<\/b><br \/>\r\n<br \/>\r\nFirst off, they&rsquo;re right in the MIDDLE of the gym by the cable machine. Second, check to make sure there aren&rsquo;t any weight-collars off to the side of whatever rack you&rsquo;re using&mdash;when half of the collars are piled by one bench you can tell people are getting lazy.<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/DhFGGO3.jpg?1'><br \/>\r\n<br \/>\r\n<b>6. If The Payne Whitney Trainers Give You &ldquo;Recognition Nods&rdquo; . . . +1<\/b><br \/>\r\n<br \/>\r\nDoesn&rsquo;t matter whether you&rsquo;re squatting 600 pounds or if you do an hour of cardio and core on a daily basis. If the &ldquo;big guy&rdquo;, the &ldquo;old guy&rdquo;, or any other trainer knows you well enough by sight that he or she gives you &ldquo;the nod&rdquo; at some point, then you know you&rsquo;ve made it to the big leagues.<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/XvtHhhD.gif?1' width='100%'><br \/>\r\n* Bonus point if you give other gym-regulars &ldquo;the nod&rdquo; when you see each other outside of Payne Whitney.<br \/>\r\n<br \/>\r\n<b>7. If You Say You&rsquo;ve Got No Time . . . -1 <\/b><br \/>\r\n<br \/>\r\nIn my opinion, this should get a -50. If you&rsquo;ve got no time to take care of your body with some kind of regular physical activity you probably should re-examine your life. Even after an all-nighter studying for Intermediate Micro or Biochem, party-hopping from pregames to DKE, SAE, Box, and finally Toads, or binge-watching Netflix til your eyes hurt (been there waaaAAYYY too many times), you can still make time for at least a short run on the treadmill or a couple sets of dips. Chances are, there&rsquo;s something that can and should help you take care of your body. Endorphins are good for your soul! <br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/1q9rH7J.jpg?1'><br \/>\r\n<br \/>\r\n<b>8. If Residential College Gyms Just Don&rsquo;t Cut It . . . +1<\/b><br \/>\r\nYou couldn&rsquo;t get yourself to make the trek over to Payne Whitney for whatever reason, were forced to do a workout in your college&rsquo;s weight room, and found yourself frankly a little disappointed and reminiscing fondly over the high-ceilinged, vast expanse of Payne Whitney&rsquo;s 4th floor. Essentially, you get a point if working out in your residential college makes you feel like this:<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/oY2OmoB.jpg?1'><br \/>\r\n<br \/>\r\n<b>9. If You Don&rsquo;t Know Gym Etiquette . . . -1<\/b><br \/>\r\nRegardless of whether you&rsquo;re consciously lazy\/selfish and go to the gym every day, or whether you just don&rsquo;t know the etiquette because it&rsquo;s your first time doing deadlifts, there are some rules you should follow. Here are three simple ones:<br \/>\r\n- If you use free weights or put weights on some kind of bar, rack &lsquo;em up when you&rsquo;re done.<br \/>\r\n- If you leave a puddle of sweat on a machine or mat, wipe it down before you move on.<br \/>\r\n- If you are doing some kind of circuit, let people work-in with you.<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/GnLGex4.jpg?1'><br \/>\r\n<br \/>\r\n<b>10. You Alway Have a Back-Up . . . +1<\/b><br \/>\r\nPayne Whitney just ditched 1 out of its 2 big cable machines. This creates a pretty big traffic jam with the 6-7am crew let alone the peak hours of 4-7pm. It helps to be flexible with your workouts, whether you want to do cable flyes or 30 minutes on the elliptical. If all the 20 pound dumbbells you use for curls are being used, having a knowledge of alternate exercises is key to make sure you&rsquo;re not either sitting on your bum looking lost or breathing down the neck of whoever is using them. Pick up an E-Z curl bar or do some chin-ups!<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/hHZMFTn.jpg?1'><br \/>\r\n<br \/>\r\n<b>11. If You&rsquo;ve Farted At Least Once . . . +1<\/b><br \/>\r\nWhen you&rsquo;re mid-squat with your whole body straining, your clenched muscles will sometimes force out the pressurized air within you. Hell, I&rsquo;ve done it enough that at this point I barely even chuckle when it happens. Payne Whitney&rsquo;s gym is spacious enough that the smell should dissipate quickly enough anyways&mdash;remember, PV=nRT (from way back when you took basic Chem). <br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/zVPSmDG.jpg?1'><br \/>\r\n<br \/>\r\n<b>12. If You&rsquo;ve Memorized Payne Whitney&rsquo;s Regular Weekly Hours . . . +1<\/b><br \/>\r\nHell yeah! You know that Monday-Thursday you&rsquo;ve got a whole 16 hours to hit the gym, Friday still has a sizeable 14 hours, and Saturday and Sunday you&rsquo;d better get in and out, because Payne Whitney is only open for 7 hours. If you don&rsquo;t know which hours I&rsquo;m referring to, then you must not be crazy enough for this last point.<br \/>\r\n<br \/>\r\n<img src='http:\/\/i.imgur.com\/VXHKub8.png?1'>","img":"http:\/\/i.imgur.com\/UjCR4vw.jpg","summary":"Yale&rsquo;s student body is pretty darn active as a whole. Whether you play a varsity sport, frequent the IM fields, or run up\/down Science Hill twice a day in between classes, many of us enjoy the benefits of rigorous physical activity. But, how do you see yourself? Do you consider yourself a gym-rat? Do you feel that climbing the three stairs to your first-floor room constitutes enough muscle exertion on a daily basis?","keywords":"aryeh coburn-soloway, signs, payne, whitney"}